# -*- org-image-actual-width: 1000; -*-
#+OPTIONS: toc:nil

** Info

- *Git revisions*

   #+begin_src shell :results verbatim
     cd ~/dev/roc-streaming/roc-toolkit && git log -1 --format=short
   #+end_src

   #+results:
   : commit 5e8528929835d8c8844ce3fd020047373488e6ab
   : Author: Mikhail Baranov <baranov.mv@gmail.com>
   : 
   :     Slot provides Control endpoints ts

   #+begin_src shell :results verbatim
     cd ~/dev/roc-streaming/csvplotter && git log -1 --format=short
   #+end_src

   #+results:
   : commit 1ef0a47962b9071c2cc76175c59179ddf7895d12
   : Author: Mikhail Baranov <baranov.mv@gmail.com>
   : 
   :     plot t1-t4 stats

- *Estimate clock offset*

   Rough difference between unix time on two machines.

   #+begin_src shell :results verbatim
     ssh raspberrypi-4b.lan "date -u +%s" | awk -v local="$(date -u +%s)" '{print local - $1}'
   #+end_src

   #+results:
   : 11799153

- *Estimate ping*

   #+begin_src shell :results verbatim
     ping -q -i 0.002 -c 1000 raspberrypi-4b.lan
   #+end_src

   #+results:
   : PING raspberrypi-4b.lan (192.168.0.141) 56(84) bytes of data.
   : 
   : --- raspberrypi-4b.lan ping statistics ---
   : 1000 packets transmitted, 984 received, 1.6% packet loss, time 3355ms
   : rtt min/avg/max/mdev = 1.353/5.328/158.987/13.725 ms, pipe 16

** Statistics

#+begin_src jupyter-python :session report02
  format_tables(stats_table('rtt', data[:,1]),
                jitter_table('rtt_jitter', data[:,1]))
#+end_src

#+results:
|       | *=rtt=*   | *=rtt_jitter=* |
|-------+-----------+----------------|
| *min* | 2.346 ms  | 0.000 ms       |
| *max* | 42.096 ms | 25.775 ms      |
| *avg* | 5.724 ms  | 0.804 ms       |
| *p95* | 13.945 ms | 3.204 ms       |


** Statistics

#+begin_src jupyter-python :session report02
  format_tables(jitter_table('clock_offset_jitter', data[:,2]))
#+end_src

#+results:
|       | *=clock_offset_jitter=* |
|-------+-------------------------|
| *min* | 0.000 ms                |
| *max* | 0.843 ms                |
| *avg* | 0.020 ms                |
| *p95* | 0.060 ms                |

#+begin_src jupyter-python :session report02
  format_tables(drift_table('clock_offset_drift', data[:,0], data[:,2]))
#+end_src

#+results:
|           | *=clock_offset_drift=* |
|-----------+------------------------|
| *sec/sec* |               0.000013 |
| *sec/day* |                  1.141 |
